---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.GetCombinedParameters
source: html/fe772ceb-b239-4da3-e3c3-5fb4a42d1f88.htm
---
# Autodesk.Revit.DB.ScheduleField.GetCombinedParameters Method

Gets this field's combine parameter array if applicable

## Syntax (C#)
```csharp
public IList<TableCellCombinedParameterData> GetCombinedParameters()
```

## Returns
Gets array of TableCellCombinedParameterData with the combined parameters data